# CableTrayConduitBase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayConduitBase Class
Members See Also
---
The CableTrayConduitBase class is implemented as the base class for cable tray or conduit
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CableTrayConduitBase : MEPCurve
```

Visual Basic
---
```text
Public Class CableTrayConduitBase _
	Inherits MEPCurve
```

Visual C++
---
```text
public ref class CableTrayConduitBase : public MEPCurve
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB.Electrical..::..CableTrayConduitBase Autodesk.Revit.DB.Electrical..::..CableTray Autodesk.Revit.DB.Electrical..::..Conduit
# See Also
CableTrayConduitBase Members
Autodesk.Revit.DB.Electrical Namespace